
&НаКлиенте
Процедура ЗагрузитьВалюты(Команда)
	Если НЕ ЗначениеЗаполнено(ДатаЗагрузки) Тогда 
		Сообщить("Не выбрана дата загрузки!", СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
		ЗагрузитьКурсыВалют(ДатаЗагрузки);
КонецПроцедуры



Процедура ЗагрузитьКурсыВалют(фДатаЗагрузки) Экспорт
		
	//Создаем прокси для обращения к внешнему веб-сервису,
	// передаем в функцию URI пространства имен, имя сервиса, имя порта.
	Прокси = WSСсылки.CBR_DailyInfoWebServ.СоздатьWSПрокси(
                                         "http://web.cbr.ru/", "DailyInfo", "DailyInfoSoap");
	
	//Получаем тип параметра, который передается в метод GetCursOnDate.
	ТипWSПараметра = Прокси.ФабрикаXDTO.Пакеты.Получить(
                                        "http://web.cbr.ru/").Получить("GetCursOnDate");
	//Создаем параметр на основе типа и заполняем значение параметра On_Date.
	WSПараметр	   = Прокси.ФабрикаXDTO.Создать(ТипWSПараметра);
	WSПараметр.On_Date	= фДатаЗагрузки;
	
	//Вызываем метод веб-сервиса, записываем результат в переменную КурсыВалют.
	КурсыВалют = Прокси.GetCursOnDate(WSПараметр);
	
	//Перебираем таблицу ValuteCursOnDate, каждое значение таблицы
	// добавляем в таблицу на форме (колонки заполняем соответствующими значениями). 
	Счетчик = 0;
	Для Каждого Элемент Из КурсыВалют.GetCursOnDateResult.diffgram.ValuteData.ValuteCursOnDate Цикл 
		Если Счетчик = 10 Тогда
		Название = Элемент.Vname;
		Номинал = Элемент.Vnom;
		Курс = Элемент.Vcurs;
		КонецЕсли;
	Счетчик = Счетчик + 1;
	КонецЦикла;
	
КонецПроцедуры