
&НаКлиенте
Процедура Мэджик(Команда)
	МэджикНаСервере();
КонецПроцедуры

&НаСервере
Процедура МэджикНаСервере()
	АксесТокен = Константы.АксесТокен.Получить();
	КлиентИД = Константы.КлиентИД.Получить();
	РефрешТокен = Константы.РефрешТокен.Получить();
	КлиентСекрет = Константы.СекретКлюч.Получить();
	Сообщить(Константы.СекретКлюч.Получить());
	HttpsЗапрос();
КонецПроцедуры


&НаСервере
Процедура HttpsЗапрос()
   
//	ПараметрыЗапроса = Новый Массив;
//	ПараметрыЗапроса.Добавить("client_id=" + Константы.КлиентИД.Получить());
//    ПараметрыЗапроса.Добавить("client_secret=" + Константы.СекретКлюч.Получить());
//    ПараметрыЗапроса.Добавить("grant_type=authorization_code");
//    ПараметрыЗапроса.Добавить("code=" + Константы.AuthCode.Получить());
//    ПараметрыЗапроса.Добавить("redirect_uri=google.com");

	JSONЗапрос = Новый ЗаписьJSON;
	JSONЗапрос.УстановитьСтроку();
	Данные = Новый Структура;
	Данные.Вставить("client_id", Константы.КлиентИД.Получить());
	Данные.Вставить("client_secret", Константы.СекретКлюч.Получить());
	Данные.Вставить("grant_type", "authorization_code");
	Данные.Вставить("code", Константы.AuthCode.Получить());
	Данные.Вставить("redirect_uri", "https://google.com");
	
	ЗаписатьJSON(JSONЗапрос, Данные);
    СтрокаJS = JSONЗапрос.Закрыть();
	ЗаголовокЗапросаHTTP = Новый Соответствие();
	ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json; charset=utf-8");
	
	//АдресРесурса = СтрСоединить(ПараметрыЗапроса, "&");
	АдресРесурса = "/oauth2/access_token"; 	
	 
	Соединение = Новый HTTPСоединение("dantufyev.amocrm.ru", 443,,,,, Новый ЗащищенноеСоединениеOpenSSL() );
	
    
    Запрос = Новый HTTPЗапрос(АдресРесурса, ЗаголовокЗапросаHTTP);
    Запрос.УстановитьТелоИзСтроки(СтрокаJS);
	РезультатЗапроса = Соединение.ВызватьHTTPМетод("POST", Запрос); 
    ОкноОтвета = РезультатЗапроса.ПолучитьТелоКакСтроку();
    
КонецПроцедуры




Функция СтруктураURI(Знач СтрокаURI) Экспорт
 
  СтрокаURI = СокрЛП(СтрокаURI);
 
  // схема
  Схема = "";
  Позиция = Найти(СтрокаURI, "://");
  Если Позиция > 0 Тогда
    Схема = НРег(Лев(СтрокаURI, Позиция - 1));
    СтрокаURI = Сред(СтрокаURI, Позиция + 3);
  КонецЕсли;

  // строка соединения и путь на сервере
  СтрокаСоединения = СтрокаURI;
  ПутьНаСервере = "";
  Позиция = Найти(СтрокаСоединения, "/");
  Если Позиция > 0 Тогда
    ПутьНаСервере = Сред(СтрокаСоединения, Позиция + 1);
    СтрокаСоединения = Лев(СтрокаСоединения, Позиция - 1);
  КонецЕсли;
   
  // информация пользователя и имя сервера
  СтрокаАвторизации = "";
  ИмяСервера = СтрокаСоединения;
  Позиция = Найти(СтрокаСоединения, "@");
  Если Позиция > 0 Тогда
    СтрокаАвторизации = Лев(СтрокаСоединения, Позиция - 1);
    ИмяСервера = Сред(СтрокаСоединения, Позиция + 1);
  КонецЕсли;
 
  // логин и пароль
  Логин = СтрокаАвторизации;
  Пароль = "";
  Позиция = Найти(СтрокаАвторизации, ":");
  Если Позиция > 0 Тогда
    Логин = Лев(СтрокаАвторизации, Позиция - 1);
    Пароль = Сред(СтрокаАвторизации, Позиция + 1);
  КонецЕсли;
 
  // хост и порт
  Хост = ИмяСервера;
  Порт = "";
  Позиция = Найти(ИмяСервера, ":");
  Если Позиция > 0 Тогда
    Хост = Лев(ИмяСервера, Позиция - 1);
    Порт = Сред(ИмяСервера, Позиция + 1);
  КонецЕсли;
 
  Результат = Новый Структура;
  Результат.Вставить("Схема", Схема);
  Результат.Вставить("Логин", Логин);
  Результат.Вставить("Пароль", Пароль);
  Результат.Вставить("ИмяСервера", ИмяСервера);
  Результат.Вставить("Хост", Хост);
  Результат.Вставить("Порт", ?(Порт <> "", Число(Порт), Неопределено));
  Результат.Вставить("ПутьНаСервере", ПутьНаСервере);
 
  Возврат Результат;
 
КонецФункции
    

