
&НаКлиенте
Процедура Мэджик(Команда)
	МэджикНаСервере();
КонецПроцедуры

&НаСервере
Процедура МэджикНаСервере()
	АксесТокен = Константы.АксесТокен.Получить();
	КлиентИД = Константы.КлиентИД.Получить();
	РефрешТокен = Константы.РефрешТокен.Получить();
	КлиентСекрет = Константы.СекретКлюч.Получить();
	Сообщить(Константы.СекретКлюч.Получить());
	HttpsЗапрос();
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьЗадачи(Команда)
	ПолучитьЗадачиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьЗадачиНаСервере()
	JSONЗапрос = Новый ЗаписьJSON;
	JSONЗапрос.УстановитьСтроку();
	Данные = Новый Структура;
	Данные.Вставить("limit", 10);
	
	ЗаписатьJSON(JSONЗапрос, Данные);
    СтрокаJS = JSONЗапрос.Закрыть();
	ЗаголовокЗапросаHTTP = Новый Соответствие();
	ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json");
	ЗаголовокЗапросаHTTP.Вставить("Authorization", "Bearer " + Константы.АксесТокен.Получить());
	
	//АдресРесурса = СтрСоединить(ПараметрыЗапроса, "&");
	АдресРесурса = "/api/v4/tasks"; 	
	 
	Соединение = Новый HTTPСоединение("salamalecum.amocrm.ru", 443,,,,, Новый ЗащищенноеСоединениеOpenSSL() );
	
    
    Запрос = Новый HTTPЗапрос(АдресРесурса, ЗаголовокЗапросаHTTP);
    Запрос.УстановитьТелоИзСтроки(СтрокаJS);
	РезультатЗапроса = Соединение.ВызватьHTTPМетод("GET", Запрос); 
    ОтветЗадачи = "";
    ЧтениеJSON = Новый ЧтениеJSON();
    ОкноОтвета = РезультатЗапроса.ПолучитьТелоКакСтроку();
    ЧтениеJSON.УстановитьСтроку(ОкноОтвета);
    ЗаписьЗадача = 0;
    Пока ЧтениеJSON.Прочитать() Цикл
    	Если ЧтениеJSON.ТипТекущегоЗначения = ТипЗначенияJSON.ИмяСвойства ИЛИ ЧтениеJSON.ТипТекущегоЗначения = ТипЗначенияJSON.Строка ИЛИ ЧтениеJSON.ТипТекущегоЗначения = ТипЗначенияJSON.Число Тогда
	    	Если ЧтениеJSON.ТекущееЗначение = "text" Или ЧтениеJSON.ТекущееЗначение = "complete_till" Тогда
	    		Если ЗаписьЗадача = 1 Тогда
	    			ЗаписьЗадача = 2;
	    		Иначе
	    			ЗаписьЗадача = 1;
	    		КонецЕсли;
	    	КонецЕсли;
	    	Если НЕ ЧтениеJSON.ТекущееЗначение = "text" И НЕ ЧтениеJSON.ТекущееЗначение = "complete_till" И НЕ ЧтениеJSON.ТекущееЗначение = "result" Тогда
	    		Если ЗаписьЗадача = 1 Тогда
	    			ОтветЗадачи = ОтветЗадачи + Строка(ЧтениеJSON.ТекущееЗначение) + " ";
	    		КонецЕсли;
	    		Если ЗаписьЗадача = 2 Тогда
	    			Резз = TimestampВДату(ЧтениеJSON.ТекущееЗначение);
	    			ОтветЗадачи = ОтветЗадачи + "до " + Строка(Резз) + " " + Символы.ПС;
	    			ЗаписьЗадача = 0;
	    		КонецЕсли;
	    	КонецЕсли;
    	КонецЕсли;
    	
    	
    КонецЦикла;
    ЧтениеJSON.Закрыть();
    Сообщить(ОтветЗадачи);
    
КонецПроцедуры

Функция TimestampВДату(пДатаТС)
 Попытка
 Возврат Дата("19700101")+?(ТипЗнч(пДатаТС) = Тип("Строка"), Число(пДатаТС), пДатаТС);
 Исключение
 Возврат Неопределено;
 КонецПопытки;
КонецФункции

&НаКлиенте
Процедура ОбновитьТокен(Команда)
	ОбновитьТокенНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьТокенНаСервере()
	JSONЗапрос = Новый ЗаписьJSON;
	JSONЗапрос.УстановитьСтроку();
	Данные = Новый Структура;
	Данные.Вставить("client_id", Константы.КлиентИД.Получить());
	Данные.Вставить("client_secret", Константы.СекретКлюч.Получить());
	Данные.Вставить("grant_type", "refresh_token");
	Данные.Вставить("refresh_token", Константы.РефрешТокен.Получить());
	Данные.Вставить("redirect_uri", "https://google.com");
	
	ЗаписатьJSON(JSONЗапрос, Данные);
    СтрокаJS = JSONЗапрос.Закрыть();
	ЗаголовокЗапросаHTTP = Новый Соответствие();
	ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json");
	ЗаголовокЗапросаHTTP.Вставить("Authorization", "Bearer " + Константы.АксесТокен.Получить());
	
	//АдресРесурса = СтрСоединить(ПараметрыЗапроса, "&");
	АдресРесурса = "/oauth2/access_token"; 	
	 
	Соединение = Новый HTTPСоединение("salamalecum.amocrm.ru", 443,,,,, Новый ЗащищенноеСоединениеOpenSSL() );
	
    
    Запрос = Новый HTTPЗапрос(АдресРесурса, ЗаголовокЗапросаHTTP);
    Запрос.УстановитьТелоИзСтроки(СтрокаJS);
	РезультатЗапроса = Соединение.ВызватьHTTPМетод("POST", Запрос); 
    ОкноОтвета = РезультатЗапроса.ПолучитьТелоКакСтроку();
    
    ЧтениеJSON = Новый ЧтениеJSON();
    ЧтениеJSON.УстановитьСтроку(ОкноОтвета);
    ЗаписьТокен = 0;
    Пока ЧтениеJSON.Прочитать() Цикл
    	Если ЧтениеJSON.ТипТекущегоЗначения = ТипЗначенияJSON.ИмяСвойства ИЛИ ЧтениеJSON.ТипТекущегоЗначения = ТипЗначенияJSON.Строка Тогда
	    	Если ЧтениеJSON.ТекущееЗначение = "access_token" Или ЧтениеJSON.ТекущееЗначение = "refresh_token" Тогда
	    		Если ЗаписьТокен = 1 Тогда
	    			ЗаписьТокен = 2;
	    		Иначе
	    			ЗаписьТокен = 1;
	    		КонецЕсли;
	    	КонецЕсли;
	    	Если НЕ ЧтениеJSON.ТекущееЗначение = "access_token" И НЕ ЧтениеJSON.ТекущееЗначение = "refresh_token" Тогда
	    		Если ЗаписьТокен = 1 Тогда
	    			Константы.АксесТокен.Установить(ЧтениеJSON.ТекущееЗначение);
	    		КонецЕсли;
	    		Если ЗаписьТокен = 2 Тогда
	    			Константы.РефрешТокен.Установить(ЧтениеJSON.ТекущееЗначение);
	    		КонецЕсли;
	    	КонецЕсли;
    	КонецЕсли;
    	
    КонецЦикла;
    ЧтениеJSON.Закрыть();
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьЗадачу(Команда)
	ДобавитьЗадачуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗадачуНаСервере()
	JSONЗапрос = Новый ЗаписьJSON;
	JSONЗапрос.УстановитьСтроку();
	ТелоМассив = Новый Массив(1);
	Данные = Новый Структура;
	Данные.Вставить("task_type_id", 1);
	Данные.Вставить("text", ОписаниеЗадачи);
	Данные.Вставить("complete_till", Число(Формат(Дедлайн - дата(1970,1,1,1,0,0), "ЧГ=0")));
	ТелоМассив[0] = Данные;
	
	ЗаписатьJSON(JSONЗапрос, ТелоМассив);
    СтрокаJS = JSONЗапрос.Закрыть();
	ЗаголовокЗапросаHTTP = Новый Соответствие();
	ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json");
	ЗаголовокЗапросаHTTP.Вставить("Authorization", "Bearer " + Константы.АксесТокен.Получить());
	
	//АдресРесурса = СтрСоединить(ПараметрыЗапроса, "&");
	АдресРесурса = "/api/v4/tasks"; 	
	 
	Соединение = Новый HTTPСоединение("dantufyev.amocrm.ru", 443,,,,, Новый ЗащищенноеСоединениеOpenSSL() );
	
    
    Запрос = Новый HTTPЗапрос(АдресРесурса, ЗаголовокЗапросаHTTP);
    Запрос.УстановитьТелоИзСтроки(СтрокаJS);
	РезультатЗапроса = Соединение.ВызватьHTTPМетод("POST", Запрос); 
    ОкноОтвета = РезультатЗапроса.ПолучитьТелоКакСтроку();
КонецПроцедуры




&НаСервере
Процедура HttpsЗапрос()
   
//	ПараметрыЗапроса = Новый Массив;
//	ПараметрыЗапроса.Добавить("client_id=" + Константы.КлиентИД.Получить());
//    ПараметрыЗапроса.Добавить("client_secret=" + Константы.СекретКлюч.Получить());
//    ПараметрыЗапроса.Добавить("grant_type=authorization_code");
//    ПараметрыЗапроса.Добавить("code=" + Константы.AuthCode.Получить());
//    ПараметрыЗапроса.Добавить("redirect_uri=google.com");

	JSONЗапрос = Новый ЗаписьJSON;
	JSONЗапрос.УстановитьСтроку();
	Данные = Новый Структура;
	Данные.Вставить("client_id", Константы.КлиентИД.Получить());
	Данные.Вставить("client_secret", Константы.СекретКлюч.Получить());
	Данные.Вставить("grant_type", "authorization_code");
	Данные.Вставить("code", Константы.AuthCode.Получить());
	Данные.Вставить("redirect_uri", "https://google.com");
	
	ЗаписатьJSON(JSONЗапрос, Данные);
    СтрокаJS = JSONЗапрос.Закрыть();
	ЗаголовокЗапросаHTTP = Новый Соответствие();
	ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json; charset=utf-8");
	
	//АдресРесурса = СтрСоединить(ПараметрыЗапроса, "&");
	АдресРесурса = "/oauth2/access_token"; 	
	 
	Соединение = Новый HTTPСоединение("dantufyev.amocrm.ru", 443,,,,, Новый ЗащищенноеСоединениеOpenSSL() );
	
    
    Запрос = Новый HTTPЗапрос(АдресРесурса, ЗаголовокЗапросаHTTP);
    Запрос.УстановитьТелоИзСтроки(СтрокаJS);
	РезультатЗапроса = Соединение.ВызватьHTTPМетод("POST", Запрос); 
    ОкноОтвета = РезультатЗапроса.ПолучитьТелоКакСтроку();
    ЧтениеJSON = Новый ЧтениеJSON();
    ЧтениеJSON.УстановитьСтроку(ОкноОтвета);
    ЗаписьТокен = 0;
    Пока ЧтениеJSON.Прочитать() Цикл
    	Если ЧтениеJSON.ТипТекущегоЗначения = ТипЗначенияJSON.ИмяСвойства ИЛИ ЧтениеJSON.ТипТекущегоЗначения = ТипЗначенияJSON.Строка Тогда
	    	Если ЧтениеJSON.ТекущееЗначение = "access_token" Или ЧтениеJSON.ТекущееЗначение = "refresh_token" Тогда
	    		Если ЗаписьТокен = 1 Тогда
	    			ЗаписьТокен = 2;
	    		Иначе
	    			ЗаписьТокен = 1;
	    		КонецЕсли;
	    	КонецЕсли;
	    	Если НЕ ЧтениеJSON.ТекущееЗначение = "access_token" И НЕ ЧтениеJSON.ТекущееЗначение = "refresh_token" Тогда
	    		Если ЗаписьТокен = 1 Тогда
	    			Константы.АксесТокен.Установить(ЧтениеJSON.ТекущееЗначение);
	    		КонецЕсли;
	    		Если ЗаписьТокен = 2 Тогда
	    			Константы.РефрешТокен.Установить(ЧтениеJSON.ТекущееЗначение);
	    		КонецЕсли;
	    	КонецЕсли;
    	КонецЕсли;
    	
    КонецЦикла;
    ЧтениеJSON.Закрыть();
    
    
    
    
КонецПроцедуры




Функция СтруктураURI(Знач СтрокаURI) Экспорт
 
  СтрокаURI = СокрЛП(СтрокаURI);
 
  // схема
  Схема = "";
  Позиция = Найти(СтрокаURI, "://");
  Если Позиция > 0 Тогда
    Схема = НРег(Лев(СтрокаURI, Позиция - 1));
    СтрокаURI = Сред(СтрокаURI, Позиция + 3);
  КонецЕсли;

  // строка соединения и путь на сервере
  СтрокаСоединения = СтрокаURI;
  ПутьНаСервере = "";
  Позиция = Найти(СтрокаСоединения, "/");
  Если Позиция > 0 Тогда
    ПутьНаСервере = Сред(СтрокаСоединения, Позиция + 1);
    СтрокаСоединения = Лев(СтрокаСоединения, Позиция - 1);
  КонецЕсли;
   
  // информация пользователя и имя сервера
  СтрокаАвторизации = "";
  ИмяСервера = СтрокаСоединения;
  Позиция = Найти(СтрокаСоединения, "@");
  Если Позиция > 0 Тогда
    СтрокаАвторизации = Лев(СтрокаСоединения, Позиция - 1);
    ИмяСервера = Сред(СтрокаСоединения, Позиция + 1);
  КонецЕсли;
 
  // логин и пароль
  Логин = СтрокаАвторизации;
  Пароль = "";
  Позиция = Найти(СтрокаАвторизации, ":");
  Если Позиция > 0 Тогда
    Логин = Лев(СтрокаАвторизации, Позиция - 1);
    Пароль = Сред(СтрокаАвторизации, Позиция + 1);
  КонецЕсли;
 
  // хост и порт
  Хост = ИмяСервера;
  Порт = "";
  Позиция = Найти(ИмяСервера, ":");
  Если Позиция > 0 Тогда
    Хост = Лев(ИмяСервера, Позиция - 1);
    Порт = Сред(ИмяСервера, Позиция + 1);
  КонецЕсли;
 
  Результат = Новый Структура;
  Результат.Вставить("Схема", Схема);
  Результат.Вставить("Логин", Логин);
  Результат.Вставить("Пароль", Пароль);
  Результат.Вставить("ИмяСервера", ИмяСервера);
  Результат.Вставить("Хост", Хост);
  Результат.Вставить("Порт", ?(Порт <> "", Число(Порт), Неопределено));
  Результат.Вставить("ПутьНаСервере", ПутьНаСервере);
 
  Возврат Результат;
 
КонецФункции
    

