
&НаКлиенте
Процедура ПолучитьДанные(Команда)
	HttpsЗапрос();	
КонецПроцедуры

&НаСервере
Процедура HttpsЗапрос()
 
   
	Заголовки = Новый Соответствие; 
	
	Заголовки.Вставить("X-Yandex-API-Key", Константы.КлючАпи.Получить());
	 
	Соединение = Новый HTTPСоединение("api.weather.yandex.ru", 443,,,,, Новый ЗащищенноеСоединениеOpenSSL() );
	
    
    Запрос = Новый HTTPЗапрос("/v2/forecast?lat=64.542966&lon=40.537113&limit=3&hours=false", Заголовки);
    
    РезультатЗапроса = Соединение.Получить(Запрос); 
    Инфо = РезультатЗапроса.ПолучитьТелоКакСтроку();
    ТелоЗапроса = РезультатЗапроса.ПолучитьТелоКакСтроку();
    
    ЧтениеJSON = Новый ЧтениеJSON;
    ЧтениеJSON.УстановитьСтроку(ТелоЗапроса);
    ДатаК = Строка("2021" + "-0" + Строка(Месяц(ТекущаяДата())) + "-" + Строка(День(ТекущаяДата())+2));
    //Сообщить(ДатаК);
    Темп = 0;
    ОТемп = 0;
    Описание = "";
    СкоростьВетра = 0;
    ПДата = Ложь;
    Санрайз = "";
    НаправлениеВетра = "";
    ДатаПрогноза = "";
    Запись = Истина;
    НужнаяДата = Ложь;
    Прогноз = Ложь;
    День = Ложь;
    Счетчик = 0;
    Пока ЧтениеJSON.Прочитать() Цикл
 		Если ЧтениеJSON.ТипТекущегоЗначения = ТипЗначенияJSON.ИмяСвойства Тогда
	 			Если ЧтениеJSON.ТекущееЗначение = "forecasts" Тогда
	 				Прогноз = Истина;
	 			КонецЕсли;
 		КонецЕсли;
 		
 		Если Прогноз Тогда
 		
 		Если ПДата Тогда
 			ПДата = Ложь;
 			Если ЧтениеJSON.ТекущееЗначение = ДатаК Тогда
 				НужнаяДата = Истина;
 				ДатаПрогноза = ЧтениеJSON.ТекущееЗначение;
 				Темп = 0;
			    ОТемп = 0;
			    Описание = "";
			    СкоростьВетра = 0;
			    Санрайз = "";
			    НаправлениеВетра = "";
			    Счетчик = 1;
 			КонецЕсли;
 		КонецЕсли;
 		
 		//Если ЧтениеJSON.ТекущееЗначение = "sunrise" Тогда
 		//		Санрайз = "гкз";
 		//КонецЕсли;
 		Если ЧтениеJSON.ТипТекущегоЗначения = ТипЗначенияJSON.ИмяСвойства Тогда
	 			Если ЧтениеJSON.ТекущееЗначение = "day" Тогда
	 				 День = Истина;
	 				 Темп = 0;
					 ОТемп = 0;
					    Описание = "";
					    СкоростьВетра = 0;
					    НаправлениеВетра = "";
					    Счетчик = 1;
	 			КонецЕсли;
	 			Если ЧтениеJSON.ТекущееЗначение = "night" Тогда
	 				 День = Ложь;
	 			КонецЕсли;
	 			Если ЧтениеJSON.ТекущееЗначение = "evening" Тогда
	 				 День = Ложь;
	 			КонецЕсли;
 		КонецЕсли;
 		Если ЧтениеJSON.ТипТекущегоЗначения = ТипЗначенияJSON.ИмяСвойства Тогда
 		Если ЧтениеJSON.ТекущееЗначение = "date" Тогда
 				ДатаПрогноза = "гкз";
 				ПДата = Истина;
 		КонецЕсли;
 		КонецЕсли;
 		
 		
 		Если День И НужнаяДата Тогда		
 		Если ЧтениеJSON.ТипТекущегоЗначения = ТипЗначенияJSON.ИмяСвойства Тогда
 			Если ЧтениеJSON.ТекущееЗначение = "temp_avg" Тогда
 				Темп = -999;
 			ИначеЕсли ЧтениеJSON.ТекущееЗначение = "condition" Тогда
 				Описание = "гкз";
 			ИначеЕсли ЧтениеJSON.ТекущееЗначение = "wind_speed" Тогда
 				СкоростьВетра = -999;
 			ИначеЕсли ЧтениеJSON.ТекущееЗначение = "wind_dir" Тогда
 				НаправлениеВетра = "гкз";
 			
 			
 			ИначеЕсли ЧтениеJSON.ТекущееЗначение = "feels_like" Тогда
 				Отемп = -999;
 			КонецЕсли;		
 		КонецЕсли;
 	
 		Если ЧтениеJSON.ТипТекущегоЗначения = ТипЗначенияJSON.Булево ИЛИ
			 ЧтениеJSON.ТипТекущегоЗначения = ТипЗначенияJSON.Строка ИЛИ 
			 ЧтениеJSON.ТипТекущегоЗначения = ТипЗначенияJSON.Число ИЛИ 
			 ЧтениеJSON.ТипТекущегоЗначения = ТипЗначенияJSON.Комментарий Тогда
			 	
			 Если Запись Тогда
			 	Если Санрайз = "гкз" Тогда
			 		Санрайз = ЧтениеJSON.ТекущееЗначение;
			 		Сообщить("Санрайз- " + Санрайз);
			 		Счетчик = Счетчик + 1;
			 	КонецЕсли;
			 	Если ОТемп = -999 Тогда			
			 		ОТемп = ЧтениеJSON.ТекущееЗначение;
			 		Сообщить("Отемп- " + ОТемп);
			 		Счетчик = Счетчик + 1;
			 	КонецЕсли;
			 	Если НаправлениеВетра = "гкз" Тогда
			 		НаправлениеВетра = ЧтениеJSON.ТекущееЗначение;
			 		Сообщить("НВ- " + НаправлениеВетра);
			 		Счетчик = Счетчик + 1;
			 	КонецЕсли;	
			 	Если Описание = "гкз" Тогда
			 		Описание = ЧтениеJSON.ТекущееЗначение;
			 		Сообщить("Описание- " + Описание);
			 		Счетчик = Счетчик + 1;
			 	КонецЕсли;
			 	Если СкоростьВетра = -999 Тогда
			 		СкоростьВетра = ЧтениеJSON.ТекущееЗначение;
			 		Сообщить("СВ- " + СкоростьВетра);
			 		Счетчик = Счетчик + 1;
			 	КонецЕсли;
			 	//Если ДатаПрогноза = "гкз" Тогда
			 	//	ДатаПрогноза = ЧтениеJSON.ТекущееЗначение;
			 	//	Сообщить("Дата- " + ДатаПрогноза);
			 	//	Счетчик = Счетчик + 1;
			 	//КонецЕсли;
			 	Если Темп = -999 Тогда
			 		Темп = ЧтениеJSON.ТекущееЗначение;
			 		Сообщить("Темп- " + Темп);
			 		Счетчик = Счетчик + 1;
			 	КонецЕсли;
			 	
			 	
			 	Если Счетчик = 7 И НЕ НужнаяДата Тогда
			 		Счетчик = 0;
			 		Темп = 0;
				    ОТемп = 0;
				    Описание = "";
				    СкоростьВетра = 0;
				    Санрайз = "";
				    НаправлениеВетра = "";
				    //ДатаПрогноза = "";
			 	КонецЕсли;

			 КонецЕсли; 
			
 		КонецЕсли;
 		КонецЕсли;
 		
 		Если Темп <> 0 И ОТемп <> 0 И ОТемп <> -999 И Описание <> "" И СкоростьВетра <> 0 И НаправлениеВетра <> "" И ДатаПрогноза = ДатаК Тогда
 			Прервать;
 		КонецЕсли;
 		КонецЕсли;
 		
 				
    КонецЦикла;
    Погода = Строка(Темп) + " " + Строка(ОТемп) + " " + Описание + " " + Строка(СкоростьВетра) + " " + НаправлениеВетра + " " + ДатаПрогноза;
    ЧтениеJSON.Закрыть();
	
	
 
КонецПроцедуры
